# Задача 2
# n = int(input("Введите трехзначное число: "))
# n1 = int(n // 100)
# n2 = int(n // 10)
# n3 = int(n2%10)
# n4 = int(n%10)
# print(n1 + n3 + n4)

# Задача 4
# n = int(input("Введите общее количество журавликов: "))
# Petia = int(n // n)
# Serioja = int(n // n)
# Katia = int(n // n * 4)
# print(f'Петя сделал {Petia} журавликов, Сережа сделал {Serioja} журавликов, Катя сделала {Katia} журавликов')

# Задача 6
# n = int(input("Введите номер билета: "))
# n1 = int(n // 100000)
# n2 = int(n%100000 // 10000)
# n3 = int(n%10000 // 1000)
# n4 = int(n%1000 // 100)
# n5 = int(n%100 // 10)
# n6 = int(n%10)
# if n1+n2+n3 == n4+n5+n6:
#     print("yes")
# else:
#     print("no")

# Задача 8
# n = int(input("Введите количество долек по вертикали: "))
# m = int(input("Введите количество долек по горизонтали: "))
# k = int(input("Введите, сколько долек Вы хотите отломить: "))
# if k%n == 0 or k%m == 0 and k < m * n:
#     print("yes")
# else:
#     print("no")
